/* 分段函数的方式分别计算 */
#include<stdio.h>
#include<math.h>
int main()
{
    float p1, p2, p3, p4, p5;
    float r1 = 0.0414, r2 = 0.0468, r3 = 0.054, r5 = 0.0585, r0 = 0.0072;
    p1 = 1000 * (1 + 5 * r5); //一次存五年
    p2 = 1000 * (1 + 2 * r2) * (1 + 3 * r3); // 先存两年，后再存三年
    p3 = 1000 * (1 + 3 * r3) * (1 + 2 * r2); // 先存三年，后再存两年
    p4 = 1000 * pow((1 + r1), 5); // 存一年，连续五次
    p5 = 1000 * pow((1 + r0 / 4), 4 * 5); // 活期
    printf("p1 = %f\np2 = %f\np3 = %f\np4 = %f\np5 = %f\n", p1, p2, p3, p4, p5);
    return 0;
}
